import React from "react";
import "./Policy.css";

export const PolicyBox = () => {
    
    const policyContent = 
    `
    주야주야 개인정보처리방침



    주식회사 제론코퍼레이션(이하 “회사”라고 합니다)는 정보통신망 이용촉진 및 정보보호 등에 관한 법률 및 개인정보 보호법 등 준수하여야 할 관련 법규상의 개인정보 보호 규정을 준수하며, 관련 법규에 의거한 개인정보 처리방침을 정하여 이용자 권익 보호에 최선을 다하고 있습니다. "회사"는 본 개인정보 처리방침을 통해 이용자가 제공하는 개인정보가 어떠한 용도와 방식으로 이용되고 있으며, 개인정보 보호를 위해 어떠한 조치가 취해지고 있는지 다음과 같이 알려드립니다.

    회사는 개인정보처리방침을 개정하는 경우 웹사이트 공지사항(또는 개별공지)을 통하여 공지할 것입니다.


    1. 수집하는 개인정보 항목

    회사는 회원가입, 상담, 서비스 신청 등등을 위해 아래와 같은 개인정보를 수집하고 있습니다.

    1) 수집항목

    • 필수정보 : 아이디, 비밀번호, 이름, 휴대전화번호, 닉네임, 이메일

    • 서비스 이용 및 진행 과정에서 생성 및 수집되는 정보 : 서비스 이용기록, IP 주소, 쿠키, 방문일시, 불량 이용기록, 상담 서비스 이용기록, 부가서비스 이용기록, 커뮤니티 게시글 및 댓글에 기재된 정보, 결제 진행 시의 이름/전화번호/신용카드 결제정보(카드사명, 카드 번호 등)/은행계좌 정보 등, 이벤트 참여 시의 이름/생년월일시/고민/출생지 등의 정보

    2) 수집방법 : 사이트(회원가입, 게시판)에서 직접입력, 이벤트 참여, 서비스 이용, 제휴사로부터 제공, 단말기를 통한 자동수집

    2. 개인정보의 수집 및 이용목적

    회사는 수집한 개인정보를 다음의 목적을 위해 활용합니다. 이용자가 제공한 모든 정보는 하기 목적에 필요한 용도 이외로는 사용되지 않으며 이용 목적이 변경될 시에는 사전동의를 구할 것입니다.


    1) 홈페이지 회원가입 및 관리

    회원 가입의사 확인, 회원제 서비스 제공에 따른 본인식별·인증·회원자격 유지·관리, 회원 탈퇴의사 확인, 서비스 부정이용 방지와 비인가 사용방지, 각종 고지·통지, 고충처리, 분쟁 조정을 위한 기록 보존 등

    2) 서비스 제공에 관한 계약 이행 및 서비스 제공에 따른 요금정산

    이용자를 위한 온라인 광고 서비스 및 콘덴츠 제공, 구매 및 요금 결제, 요금추심

    3) 민원업무 처리

    민원인의 신원 확인, 민원사항 확인, 사실조사를 위한 연락·통지, 처리결과 통보 등

    4) 통계학적 분석

    이용자의 연령별/성별/지역별/소득별 통계분석, 통계분석서비스의 유효성 확인, 접속빈도 파악 또는 회원의 서비스 이용에 대한 통계 등

    5) 마케팅 및 광고에 활용

    신규 상품 및 서비스 홍보 및 상담사 추천, 경품지급, 사은행사 등 이용자에 대한 편의 제공 등. 


    3. 개인정보의 보유 및 이용기간


    회사는 이용자의 개인정보를 원칙적으로 개인정보의 수집목적 또는 제공받은 목적이 달성한 후에는 지체 없이 파기합니다.

    단, 부정이용방지나 관련 법령에 의해 보존되야만 하는 경우 "회사"는 아래의 이유로 일정 기간 회원 정보를 보관합니다.


    1) 회사 내부 방침에 의한 정보보유 사유

    • 보존이유 : 부정이용방지(시스템 버그 악용, 회원가입 무료코인 악용 등의 부정이용 방지)

    • 보존기간 : 6개월

    2) 계약 또는 청약철회 등에 관한 기록

    • 보존근거 : 전자상거래 등에서 소비자 보호에 관한 법률 근거

    • 보존기간 : 5년

    3) 대금결제 및 재화 등의 공급에 관한 기록

    • 보존근거 : 전자상거래 등에서 소비자 보호에 관한 법률 근거

    • 보존기간 : 5년

    4) 소비자의 불만 또는 분쟁처리에 관한 기록

    • 보존근거 : 전자상거래 등에서 소비자 보호에 관한 법률 근거

    • 보존기간 : 3년

    5) 표시/광고에 관한 기록

    • 보존근거 : 전자상거래 등에서 소비자 보호에 관한 법률 근거

    • 보존기간 : 6개월

    6) 전자금융에 관한 기록

    • 보존근거 : 전자금융거래법

    • 보존기간 : 5년

    7) 이용자 정보(접속로그, 서비스 이용기록 등)에 관한 기록

    • 보존근거 : 통신비밀보호법 근거

    • 보존기간 : 3개월


    4. 개인정보의 제3자 제공


    "회사"는 이용자로부터 동의받은 범위를 초과하여 개인정보를 이용하거나 제3자에게 제공 또는 공개하지 않습니다. 다만 아래와 같이 관련법령에 근거한 정보 제공의 경우에는 사전동의 없이 개인정보를 제공할 수 있습니다.

    1) 통계작성, 학술연구 또는 시장조사 등을 위하여 필요한 경우로서, 특정 개인을 식별할 수 없는 형태로 제공하는 경우

    2) 관련법령에 의하여 국가기관으로 부터 요구받은 경우

    3) 범죄에 대한 수사상의 목적이 있거나, 정보통신 윤리위원회의 요청이 있는 경우

    4) 기타 관련법령에서 정한 절차에 따른 요청이 있는 경우

    5) 제3자 정보제공에 동의한 경우


    5. 개인정보의 파기 절차 및 방법


    "회사"는 원칙적으로 개인정보 수집 및 이용 목적이 달성된 후에는 해당정보를 지체없이 파기합니다. 파기 절차 및 방법은 다음과 같습니다.


    1) 파기절차 : 이용자가 회원가입 등을 위해 입력한 정보는 목적이 달성된 후 별도의 DB로 옮겨져 (출력물, 서면 등의 경우 별도의 서류함) 내부방침 및 기타 관련법령에 의한 정보보호 사유에 따라 (보유 및 이용 기간 참조) 일정기간 저장된 후 파기됩니다.

    2) 파기방법 : 별도 DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 다른 목적으로 이용되지 않습니다. 전자적 파일 형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다. 출력물, 서면 등은 분쇄기로 분쇄하거나 소각하는 방식 등으로 파기합니다.


    6. 이용자 및 법정대리인의 권리와 그 행사방법


    1) 개인정보의 열람·정정

    이용자 및 법정대리인은 언제든지 등록되어 있는 이용자의 개인정보를 열람하거나 정정할 수 있습니다. 개인정보 열람 및 정정은 ‘개인정보변경’ 또는 ‘회원정보수정’에서 직접 처리할 수 있으며, 개인정보 보호 책임자에게 서면, 전화 또는 E-mail을 통해서도 가능합니다. 이용자가 개인정보 오류 정정을 요청한 경우, 정정 완료 전까지 당해 개인정보를 이용 또는 제공하지 않습니다. 잘못된 개인정보를 제3자에게 이미 제공한 경우에는 정정 처리결과를 제3자에게 지체없이 통지하여 정정하도록 조치하겠습니다.

    2) 개인정보의 수집·이용·제공 동의철회

    이용자 및 법정대리인은 언제든지 개인정보의 수집, 이용, 제공에 대한 동의내용을 철회할 수 있습니다. 동의철회는 개인정보 보호 책임자에게 서면, 전화, E-mail을 통해서 신청할 수 있으며, 담당자는 접수 즉시 동의철회 등록, 개인정보 파기 등의 조치를 취한 후 해당사실을 이용자에게 통지합니다. 회사는 이용자 혹은 법정 대리인의 요청에 의해 동의철회된 개인정보를 정 "3. 개인정보 보유 및 이용기간" 및 “5. 개인정보의 파기절차 및 방법”에 명시된 바에 따라 파기하고 그 외의 용도로 열람 또는 이용할 수 없도록 처리하고 있습니다.


    7. 개인정보 자동수집 장치의 설치, 운영 및 그 거부에 관한 사항


    "회사"는 이용자의 정보를 수시로 저장하고 불러오는 ‘쿠키(cookie)’를 운용합니다. 쿠키란 "회사"의 웹사이트를 운영하는데 이용되는 서버가 이용자의 컴퓨터 브라우저에 보내는 아주 작은 텍스트 파일이며 이용자의 컴퓨터 하드디스크에 저장되기도 합니다.


    1) 쿠키의 사용목적

    회원과 비회원의 접속빈도나 방문시간 등을 분석, 이용자의 취향과 관심분야를 파악 및 자취 추적, 각종 이벤트 참여 정도 및 방문회수 파악 등을 통한 타겟 마케팅 및 개인 맞춤 서비스 제공 등

    2) 쿠키의 설치/운영 및 거부

    이용자는 쿠키 설치에 대한 선택권을 가지고 있습니다. 따라서, 이용자는 웹 브라우저에서 옵션을 설정함으로써 모든 쿠키를 허용하거나, 쿠키가 저장될 때마다 확인을 거치거나, 아니면 모든 쿠키의 저장을 거부할 수도 있습니다. 단, 이용자가 쿠키 설치를 거부하였을 경우 서비스 제공에 어려움이 있을 수 있습니다.


    8. 개인정보에 관한 민원서비스

    "회사"는 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.


    1) 개인정보 보호책임자

    • 성명 : 최연욱

    • 전화번호 : 

    • 이메일 : help@jooyajooya.com


    "회사"의 서비스(또는 사업)을 이용하시면서 발생한 모든 개인정보 보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보 책임자에게 문의하실 수 있습니다. "회사"는 이용자의 문의에 대해 신속하게 충분한 답변해드릴 것입니다.

    2) 기타 개인정보침해에 대한 신고나 상담이 필요하신 경우에는 아래 기관에 문의하시기 바랍니다.


    • 개인정보침해신고센터 (http://privacy.kisa.or.kr )

    • 정보보호마크인증위원회 (http://eprivacy.or.kr / 02-580-0533~4)

    • 대검찰청 첨단범죄수사과 (http://spo.go.kr / 02-3480-2000)

    • 경찰청 사이버안전국 (http://cyberbureau.police.go.kr / 1566-0112)

    • 방송통신위원회 (http://kcc.go.kr / 02-750-1114)


    9. 개인정보의 안전성 확보 조치


    개인정보보호법 제29조에 따라 다음과 같이 안전성 확보에 필요한 기술적/관리적 및 물리적 조치를 하고 있습니다.

    1) 개인정보 처리 직원의 최소화 및 교육

    개인정보를 처리하는 직원을 지정하고 담당자에 한정시켜 최소화 하여 개인정보를 관리하는 대책을 시행하고 있습니다.

    2) 정기적인 자체 감사 실시

    개인정보 처리 관련 안정성 확보를 위해 정기적(분기 1회)으로 자체 감사를 실시하고 있습니다.

    3) 내부관리계획의 수립 및 시행

    개인정보의 안전한 처리를 위하여 내부관리계획을 수립하고 시행하고 있습니다.

    4) 개인정보의 암호화

    이용자의 개인정보는 비밀번호는 암호화 되어 저장 및 관리되고 있어, 본인만이 알 수 있으며 중요한 데이터는 파일 및 전송 데이터를 암호화 하거나 파일 잠금 기능을 사용하는 등의 별도 보안기능을 사용하고 있습니다.

    5) 해킹 등에 대비한 기술적 대책

    "회사"는 해킹이나 컴퓨터 바이러스 등에 의한 개인정보 유출 및 훼손을 막기 위하여 보안프로그램을 설치하고 주기적인 갱신·점검을 하며 외부로부터 접근이 통제된 구역에 시스템을 설치하고 기술적/물리적으로 감시 및 차단하고 있습니다.

    6) 개인정보에 대한 접근 제한

    개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의 부여, 변경, 말소를 통하여 개인정보에 대한 접근통제를 위하여 필요한 조치를 하고 있으며 침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있습니다.

    7) 접속기록의 보관 및 위변조 방지

    개인정보처리시스템에 접속한 기록을 최소 6개월 이상 보관, 관리하고 있으며, 접속 기록이 위변조 및 도난, 분실되지 않도록 보안기능 사용하고 있습니다.

    8) 문서보안을 위한 잠금장치 사용

    개인정보가 포함된 서류, 보조저장매체 등을 잠금장치가 있는 안전한 장소에 보관하고 있습니다.

    9) 비인가자에 대한 출입 통제

    개인정보를 보관하고 있는 물리적 보관 장소를 별도로 두고 이에 대해 출입통제 절차를 수립, 운영하고 있습니다.


    10. 개인정보 처리방침의 개정 및 고지의무에 관한 사항

    "회사"는 정부의 법률 및 지침 변경이나 회사의 내부 방침 변경 등으로 인하여 개인정보 처리방침을 개정하는 경우 변경된 내용을 "회사"가 운영하는 사이트, 이메일 혹은 추가적인 개인정보를 통해 7일 전에 공지하겠습니다. 변경된 개인정보처리방침은 게시한 날로부터 7일 후부터 효력이 발생합니다.
    `

    return(
        <div className="policy-container">
            {
                policyContent.split("\n").map((line, index) => (
                    <div className="policy-content">
                        <p key={index}>{line}</p>
                        <br />
                    </div>
                ))
            }
        </div>
    )
}